/*
 * Author: Mamunul Mazid
 * License: The MIT License (MIT)
 * Copyright (c) 2024 Mamunul Mazid
 */

#include <stdio.h>
#include <sstream>
#include <set>
#include "common.hpp"

string unicode_to_string(vector<int> unicodeArray) {
    icu::UnicodeString uni_str;

    for (int unicode : unicodeArray) {
        uni_str.append((UChar32)unicode);
    }

    std::string str;
    uni_str.toUTF8String(str);

    return str;
}

string all_independent_vowels = "অ আ ই ঈ উ ঊ ঋ ঌ এ ঐ ও ঔ";
string two_part_dependent_vowels = "ো ৌ";
string all_dependent_vowels =" া ি ী ◌ু ◌ূ ◌ৃ ◌ৄ ে ৈ";
string all_consontants = "ক খ গ ঘ ঙ চ ছ জ ঝ ঞ ট ঠ ড ঢ ণ ত থ দ ধ ন প ফ ব ভ ম য র ল শ ষ স হ";
string all_special_characters = ". , । ॥ ◌্  ৗ ৺ ঀ ◌ঁ ং ঃ ঽ ◌়";

string all_conjunct_glyphs =

"ক্ক ক্ট ক্ট্র ক্ত ক্ত্র ক্ন ক্ব ক্ম ক্য ক্র ক্ল ক্ষ ক্ষ্ণ ক্ষ্ব ক্ষ্ম ক্ষ্ম্য ক্ষ্য ক্স খ্য খ্র গ্ন গ্ধ গ্ধ্য গ্ধ্র গ্ন গ্ন্য গ্ব গ্ম গ্য গ্র গ্র্য গ্ল ঘ্ন ঘ্য ঘ্র ঙ্ক ঙ্‌ক্ত ঙ্ক্য ঙ্ক্ষ ঙ্খ ঙ্খ্য ঙ্গ ঙ্গ্য ঙ্ঘ ঙ্ঘ্য ঙ্ঘ্র ঙ্ম চ্চ চ্ছ চ্ছ্ব চ্ছ্র চ্ঞ চ্ব চ্য জ্জ জ্জ্ব জ্ঝ জ্ঞ জ্ব জ্য জ্র ঞ্চ ঞ্ছ ঞ্জ ঞ্ঝ ট্ট ট্ব ট্ম ট্য ট্র ড্ড ড্ব ড্ম ড্য ড্র ড়্গ ঢ্য ঢ্র ণ্ট ণ্ঠ ণ্ঠ্য ণ্ড ণ্ড্য ণ্ড্র ণ্ঢ ণ্ণ ণ্ব ণ্ম ণ্য ৎক ৎখ ত্ত ত্ত্র ত্ত্ব ত্ত্য ত্থ ত্ন ৎপ ত্ব ত্ম ত্ম্য ত্য ত্র ত্র্য ৎল ৎস থ্ব থ্য থ্র দ্গ দ্ঘ দ্দ দ্দ্ব দ্ধ দ্ব দ্ভ দ্ভ্র দ্ম দ্য দ্র দ্র্য ধ্ন ধ্ব ধ্ম ধ্য ধ্র ন্ট ন্ট্র ন্ঠ ন্ড ন্ড্র ন্ত ন্ত্ব ন্ত্য ন্ত্র ন্ত্র্য ন্থ ন্থ্র ন্দ ন্দ্য ন্দ্ব ন্দ্র ন্ধ ন্ধ্য ন্ধ্র ন্ন ন্ব ন্ম ন্য প্ট প্ত প্ন প্প প্য প্র প্র্য প্ল প্স ফ্র ফ্ল ব্জ ব্দ ব্ধ ব্ব ব্য ব্র ব্ল ভ্ব ভ্য ভ্র ভ্ল ম্ন ম্প ম্প্র ম্ফ ম্ব ম্ব্র ম্ভ ম্ভ্র ম্ম ম্য ম্র ম্ল য্য র্ক র্ক্য র্গ র্গ্য র্ঘ্য ঙ্গ র্চ্য র্জ্য জ্জ জ্ঞ র্ণ্য র্ত্য র্থ্য র্ব্য র্ম্য র্শ্য র্ষ্য র্হ্য র্খ র্গ র্গ্র র্ঘ র্চ র্ছ র্জ র্ঝ র্ট র্ড র্ণ র্ত র্ৎ র্ত্ম র্ত্র র্থ র্দ র্দ্ব র্দ্র র্ধ র্ধ্ব র্ন র্প র্ফ র্ব র্ভ র্ম র্য র্ল র্শ র্শ্ব র্ষ র্ষ্ট র্ষ্ণ র্ষ্ণ্য র্স র্হ র্হ্য র্ঢ্য ল্ক ল্ক্য ল্গ ল্ট ল্ড ল্প ল্ফ ল্ব ল্ভ ল্ম ল্য ল্ল শ্চ শ্ছ শ্ন শ্ব শ্ম শ্য শ্র শ্ল ষ্ক ষ্ক্ব ষ্ক্র ষ্ট ষ্ট্য ষ্ট্র ষ্ঠ ষ্ঠ্য ষ্ণ ষ্ণ্ব ষ্প ষ্প্র ষ্ফ ষ্ব ষ্ম ষ্য স্ক স্ক্র স্খ স্ট স্ট্র স্ত স্ত্ব স্ত্য স্ত্র স্থ স্থ্য স্ন স্ন্য স্প স্প্র স্প্‌ল স্ফ স্ব স্ম স্য স্র স্ল হ্ণ হ্নহ্ব হ্ম হ্য হ্র হ্ল";


string all_conjuct_words = "আক্কেল ডক্টর অক্ট্রয় রক্ত বক্ত্র বাচক্নবী পক্ব রুক্মিণী বাক্য চক্র বক্র ক্লান্তি পক্ষ ভক্ষক অপেক্ষা তীক্ষ্ণ ইক্ষ্বাকু লক্ষ্মী সৌক্ষ্ম্য লক্ষ্য বাক্স সখ্য সাংখ্য খ্রিস্টান রুগ্ন মুগ্ধ বৈদগ্ধ্য দোগ্ধ্রী ভগ্ন অগ্নি অগ্ন্যাস্ত্র অগ্ন্যুৎপাত অগ্ন্যাশয় দিগ্বিজয়ী যুগ্ম ভাগ্য গ্রাম ঐকাগ্র্য সামগ্র্য গ্র্যাজুয়েট গ্লানি কৃতঘ্ন শত্রুঘ্ন অশ্লাঘ্য ঘ্রাণ অঙ্ক টঙ্কা শশাঙ্ক পংক্তি অঙ্ক্য আকাঙ্ক্ষা শঙ্খ সাঙ্খ্যমান অঙ্গ সঙ্গী ব্যঙ্গ্যার্থ ব্যঙ্গ্যোক্তি সঙ্ঘ দুর্লঙ্ঘ্য অঙ্ঘ্রি বাঙ্ময় বাচ্চা ইচ্ছা জলোচ্ছ্বাস উচ্ছ্রায় যাচ্ঞা চ্বী প্রাচ্য বিপজ্জনক উজ্জ্বল কুজ্ঝটিকা জ্ঞান সজ্ঞাত জ্বর রাজ্য বজ্র অঞ্চল সঞ্চয় লাঞ্ছনা বাঞ্ছা কুঞ্জ গুঞ্জন ঝঞ্ঝা চট্টগ্রাম ছোট্ট খট্বা কুট্মল নাট্য ট্রেন আড্ডা উড্ডয়ন অন্ড্বান কুড্মল জাড্য ড্রাইভার ড্রাম খড়্‌গ ধনাঢ্য মেঢ্র ঘণ্টা নির্ঘণ্ট কণ্ঠ কণ্ঠ্য কুণ্ড পাণ্ড্য পুণ্ড্র ষণ্ঢ বিষণ্ণ স্থাণ্বীশ্বর চিণ্ময় মৃণ্ময়ী পূণ্য উৎকর্ষ উৎখাত উত্তর সত্ত্ব উত্ত্যক্ত অশ্বত্থ যত্ন রত্নাকর উৎপল রাজত্ব আত্মা দৌরাত্ম্য সত্য ত্রিশ ত্রাণ বৈচিত্র্য কাৎলা বৎসর উৎসব পৃথ্বী পথ্য থ্রি উদ্গম উদ্ঘাটন উদ্দেশ্য তদ্দ্বারা রুদ্ধ বদ্ধ বিদ্বান অদ্ভুত উদ্ভ্রান্ত ছদ্ম পদ্ম বাদ্য পদ্য রুদ্র নিদ্রিত দারিদ্র্য অর্থগৃধ্নু ধ্বনি উদরাধ্মান আরাধ্য ধ্রুব প্যান্ট কন্ট্রোল লন্ঠন গন্ডার পাউন্ড হান্ড্রেড জীবন্ত গন্তব্য সান্ত্বনা অন্ত্য মন্ত্র যন্ত্র স্বাতন্ত্র্য গ্রন্থ পান্থ অ্যান্থ্রাক্স ছন্দ অনিন্দ্য দ্বন্দ্ব কেন্দ্র অন্ধ বিন্ধ্য রন্ধ্র নবান্ন ধন্বন্তরি চিন্ময় ধন্য ধান্য পাটি-সাপ্টা ক্যাপ্টেন সুপ্ত স্বপ্ন ধাপ্পা প্রাপ্য ক্ষিপ্র প্র্যাকটিস আপ্লুত লিপ্সা ফ্রক ফ্রিজ আফ্রিকা রেফ্রিজারেটর ফ্লেভার ন্যুব্জ জব্দ শব্দ লব্ধ ডাব্বা দাতব্য কর্তব্য ব্রাহ্মণ ব্লাউজ ভ্বা সভ্য শুভ্র অভ্র ভ্লাদিমি নিম্ন কম্প শম্পা সম্প্রতি লম্ফ প্রতিবিম্ব অম্বর মেম্ব্রেন দম্ভ সম্ভ্রম সম্মান গ্রাম্য নম্র অম্ল ন্যায্য তর্ক অতর্ক্য বর্গ বর্গ্য দৈর্ঘ্য শার্ঙ্গ অর্চ্য বর্জ্য ঊর্জ্জ দুর্জ্ঞেয় বৈবর্ণ্য মর্ত্য সামর্থ্য নৈর্ব্যক্তিক নৈষ্কর্ম্য অস্পর্শ্য ঔৎকর্ষ্য গর্হ্য মূর্খ দুর্গ দুর্গ্রহ নির্গ্রন্হ দীর্ঘ অর্চনা মূর্ছনা অর্জন নির্ঝর আর্ট কোর্ট কম্ফর্টার শার্ট কার্টিজ আর্টিস্ট পোর্টম্যানটো সার্টিফিকেট কনসার্ট কার্টুন কোয়ার্টার অর্ডার লর্ড বর্ডার কার্ড বর্ণ ক্ষুধার্ত ভর্ৎসনা ক্লিন্নবর্ত্মাস্থি কর্ত্রী অর্থ নির্দয় নির্দ্বিধা আর্দ্র গোলার্ধ ঊর্ধ্ব দুর্নাম দর্প স্কার্ফ উর্বর গর্ভ ধর্ম আর্য দুর্লভ স্পর্শ পার্শ্ব ঘর্ষণ ধর্ষণ ধার্ষ্টামি ধৃষ্টতা পার্ষ্ণিকাস্থি কার্ষ্ণ্য জার্সি নার্স পার্সেল কুর্সি গার্হস্থ্য গর্হ্য দার্ঢ্য শুল্ক যাজ্ঞবল্ক্য বল্গা উল্টো ফিল্ডিং বিকল্প গুল্ফ বিল্ব বাল্ব প্রগল্ভ গুল্ম তারল্য উল্লাস পুনশ্চ শিরশ্ছেদ প্রশ্ন বিশ্ব অশ্ব জীবাশ্ম অবশ্য মিশ্র অশ্লীল শ্লোক শুষ্ক নিষ্ক্বাথ নিষ্ক্রিয় কষ্ট বৈশিষ্ট্য রাষ্ট্র শ্রেষ্ঠ নিষ্ঠ্যূত কৃষ্ণ বিষ্ণ্বিন্দ্র নিষ্পাপ নিষ্প্রয়োজন নিষ্ফল মাতৃষ্বসা উষ্ম শিষ্য মনোস্কামনা ইস্ক্রু স্খলন স্টেশন স্ট্রাইক ব্যস্ত ন্যস্ত বহিস্ত্বক অস্ত্যর্থ স্ত্রী দুঃস্থ স্বাস্থ্য স্নান কার্ৎস্ন্য আস্পর্ধা স্প্রিং স্প্লিন আস্ফালন স্বর স্মরণ শস্য অজস্র স্লোগান অপরাহ্ণ চিহ্ন আহ্বান ব্রাহ্মণ বাহ্য সহ্য হ্রদ আহ্লাদ প্রহ্লাদ";
